app/views/lists/index.html.erb

      <td><%= list.list_name %></td>
      <td><%= list.tasks.count() %></td>
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = ?  [["list_id", 7]]