app/views/users/show.html.erb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = ?  [["user_id", 1]]
---

  <% @user.lists.each do |list| %>

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = ?  [["list_id", 1]]
---
      <td><%= list.list_name %></td>
      <td><%= list.tasks.count() %></td>