app/controllers/lists_controller.rb

  def index
    @user = User.find(params[:user_id])
    @lists = @user.lists.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def show
    @user = User.find(params[:user_id])
    @list = List.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @user = User.find(params[:user_id])
    @list = @user.lists.create(list_params)

    if @list.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "lists" ("list_name", "list_num", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["list_name", "COMMIT"], ["list_num", 0], ["user_id", 1], ["created_at", 2016-12-17 14:16:56 UTC], ["updated_at", 2016-12-17 14:16:56 UTC]]
UPDATE "lists" SET "list_num" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["list_num", 0], ["updated_at", 2016-12-17 11:34:20 UTC], ["id", 3]]

  def update
    @user = User.find(params[:user_id])
    @list = List.find(params[:id])

    if @list.update(list_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "lists" SET "list_name" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["list_name", "COMMIT22"], ["updated_at", 2016-12-18 00:44:48 UTC], ["id", 7]]

  def destroy
    @user = User.find(params[:user_id])
    @list = @user.lists.find(params[:id])
    @list.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]