app/controllers/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "Alina"], ["LIMIT", 1]]
---
  def create
    user = User.find_by_user_name(params[:user_name])

SELECT  "users".* FROM "users" WHERE "users"."password_reset_token" = ? LIMIT ?  [["password_reset_token", "password_reset"], ["LIMIT", 1]]
---
  def edit
    @user = if current_user
              current_user
            else
              User.find_by_password_reset_token!(params[:id])

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$qHBdaKNY3eSoAykRqD5.ruW6Nz6PmEEDSDc.02r9bFCSOruFR9776"], ["updated_at", 2016-12-18 12:16:12 UTC], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."password_reset_token" = ? LIMIT ?  [["password_reset_token", "password_reset"], ["LIMIT", 1]]
---
  def update
    if current_user
      @user = current_user
      if @user.update(user_params)
        flash[:notice] = 'Password has been reset!'
        redirect_to user_lists_path(@user)
      else
        render 'edit'
      end

    else
      @user = User.find_by_password_reset_token!(params[:id])