app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ? AND "tasks"."completed" = ? LIMIT ?  [["list_id", 1], ["completed", false], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ? AND "tasks"."completed" = ? ORDER BY "tasks"."date" ASC  [["list_id", 1], ["completed", false]]
---
  def index
    @user = User.find(params[:user_id])
    @list = @user.lists.find(params[:list_id])
    if params[:order]
      @tasks = @list.tasks.incompleted.order([params[:order]])
    else
      @tasks = @list.tasks.incompleted.order(:date)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ? AND "tasks"."completed" = ? ORDER BY "tasks"."updated_at" ASC  [["list_id", 1], ["completed", true]]
---
  def completed
    @user = User.find(params[:user_id])
    @list = @user.lists.find(params[:list_id])
@tasks = @list.tasks.completed.order(:date)