app/controllers/tasks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ? AND (completed = false) ORDER BY imp  [["list_id", 1]]
---
    def index
      @user = User.find(params[:user_id])
      @list = @user.lists.find(params[:list_id])
      @tasks = @list.tasks.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ? AND "tasks"."id" = ? LIMIT ?  [["list_id", 2], ["id", 2], ["LIMIT", 1]]
---
    def show
      @user = User.find(params[:user_id])
      @list = @user.lists.find(params[:list_id])
      @task = @list.tasks.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "imp", "date", "comment", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "aa"], ["imp", 2], ["date", 2017-01-17 03:33:00 UTC], ["comment", ""], ["list_id", 1], ["created_at", 2017-01-07 08:30:11 UTC], ["updated_at", 2017-01-07 08:30:11 UTC]]
---
   def create
     @user = User.find(params[:user_id])
     @list = @user.lists.find(params[:list_id])
     @task = @list.tasks.create(task_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ? AND "tasks"."id" = ? LIMIT ?  [["list_id", 7], ["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", true], ["updated_at", 2017-01-08 03:27:21 UTC], ["id", 16]]
---
   def update
      @user = User.find(params[:user_id])
      @list = @user.lists.find(params[:list_id])
      @task = @list.tasks.find(params[:id])

     if @task.update(task_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ? AND "tasks"."id" = ? LIMIT ?  [["list_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
   def destroy
     @user = User.find(params[:user_id])
     @list = @user.lists.find(params[:list_id])
     @task = @list.tasks.find(params[:id])

     @task.destroy