app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "Alina"], ["password", "19980312"], ["email", "hangzhipang@gmail.com"], ["created_at", 2016-12-15 10:02:49 UTC], ["updated_at", 2016-12-15 10:02:49 UTC]]
---
  def create
    @user = User.new(user_params)
    if @user.save